// import Image from 'next/image';
import styles from '@/assets/styles/components/Footer.module.css';

const Footer = () => {
  return (
    <section className={styles.wrapper}>
      <div className={styles.inner}>
        <div className={styles.container}>
          <div className={styles.promo}>
            <div className={styles.contacts}>
              <h1>Контакты</h1>
              <ul>
                <li>ООО «СПЕЙСТУСТАДИ»</li>
                <li>8 (919) 007-49-37</li>
                <li>spacetostudyonlineschool@gmail.com</li>
                <li>
                  <p>
                    602267, Владимирская обл., <br /> г. Муром, ул. Артема, д.
                    20, кв.63
                  </p>
                </li>
              </ul>
            </div>
            <div className={styles.social}>
              <h1>Социальные сети</h1>
              <div className={styles.social_icons}>
                <div className={styles.social_icons_telegram}>
                  <svg
                    width="34"
                    height="29"
                    viewBox="0 0 34 29"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      // eslint-disable-next-line max-len
                      d="M30.4617 0.383275C30.8736 0.209927 31.3244 0.15014 31.7672 0.210137C32.21 0.270134 32.6287 0.447722 32.9796 0.724417C33.3304 1.00111 33.6008 1.3668 33.7624 1.78341C33.924 2.20003 33.9709 2.65234 33.8984 3.09328L30.1184 26.0216C29.7517 28.2333 27.3251 29.5016 25.2967 28.3999C23.6001 27.4783 21.0801 26.0583 18.8134 24.5766C17.6801 23.8349 14.2084 21.4599 14.6351 19.7699C15.0017 18.3249 20.8351 12.8949 24.1684 9.66661C25.4767 8.39828 24.8801 7.66661 23.3351 8.83328C19.4967 11.7299 13.3384 16.1349 11.3017 17.3749C9.50507 18.4683 8.56841 18.6549 7.44841 18.4683C5.40507 18.1283 3.51007 17.6016 1.96341 16.9599C-0.126593 16.0933 -0.0249264 13.2199 1.96174 12.3833L30.4617 0.383275Z"
                      fill="#26A4E5"
                    />
                  </svg>
                </div>
                <div className={styles.social_icons_vk}>
                  <svg
                    width="36"
                    height="21"
                    viewBox="0 0 36 21"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      // eslint-disable-next-line max-len
                      d="M34.1716 20.6339H30.37C28.9316 20.6339 28.4983 19.4689 25.92 16.8889C23.6666 14.7173 22.715 14.4473 22.145 14.4473C21.3566 14.4473 21.1416 14.6639 21.1416 15.7489V19.1689C21.1416 20.0939 20.8416 20.6356 18.425 20.6356C16.0805 20.4781 13.8069 19.7658 11.7916 18.5575C9.77627 17.3492 8.07685 15.6794 6.83331 13.6856C3.88062 10.0106 1.82616 5.6974 0.833313 1.08893C0.833313 0.518928 1.04998 0.00226134 2.13665 0.00226134H5.93665C6.91331 0.00226134 7.26498 0.437262 7.64831 1.44226C9.49331 6.87226 12.6416 11.5956 13.92 11.5956C14.41 11.5956 14.6233 11.3789 14.6233 10.1573V4.56393C14.4616 2.01226 13.1066 1.79726 13.1066 0.873928C13.1238 0.63033 13.2352 0.403009 13.4173 0.24025C13.5993 0.077491 13.8377 -0.00788333 14.0816 0.00226134H20.055C20.8716 0.00226134 21.1416 0.408928 21.1416 1.38559V8.9356C21.1416 9.7506 21.4916 10.0206 21.7383 10.0206C22.2283 10.0206 22.605 9.75059 23.5033 8.85393C25.4289 6.50557 27.0021 3.88921 28.1733 1.08726C28.2932 0.75085 28.5198 0.462885 28.8186 0.26729C29.1175 0.0716943 29.472 -0.0207957 29.8283 0.00392789H33.63C34.77 0.00392789 35.0116 0.573928 34.77 1.38726C33.3873 4.48462 31.6764 7.42477 29.6666 10.1573C29.2566 10.7823 29.0933 11.1073 29.6666 11.8406C30.0433 12.4106 31.3766 13.5239 32.2716 14.5823C33.575 15.8823 34.6566 17.3856 35.475 19.0323C35.8016 20.0923 35.2566 20.6339 34.1716 20.6339Z"
                      fill="#0077FE"
                    />
                  </svg>
                </div>
              </div>
            </div>
            <div className={styles.license}>
              <div className={styles.license_picture}></div>
              <p>
                Образовательная <br /> лицензия
              </p>
            </div>
          </div>
          <div className={styles.agreements}>
            <p>Пользовательское соглашение</p>
            <p>Правовая информация</p>
            <p>политика обработки персональных данных</p>
            <p>Договор оферты</p>
          </div>
          <div className={styles.inn}>
            <p>ИНН 3334024101</p>
            <p>ОГРН 1233300002363</p>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Footer;
